// let num = prompt('Назовите любое число')

// if (num % 2 == 0) {
//     alert('Это четное число')
// }
// else {
//     alert('Это нечетное число')
// }

// let name = prompt('Как Вас зовут?')

// if (name[0] === 'A' || name[0] === 'a') {
//     alert('Проходите')
// }
// else {
//     alert('Вам туда нельзя!')
// }

let name_two = prompt('Как Вас зовут?')

if (name_two.length % 2 == 0) {
    alert('В Вашем имени четное количество букв')
}
else {
    alert('В Вашем имени нечетное количество букв')
}